"""
文档内容：
Group:
    共计：783
    有description : 776
Event:
    共计：93512
    有description : 90825
    description有内容：89711
    字典词数(去掉停用词,单纯去掉特殊字符)：207840
    字典词数(去掉停用词,把特殊字符换成空格)：115999
Member:
    共计：82770
RSVPs:
    共计：65128
总计：242193


"""#倒排表的结构示例
inverted_index_pre = {
    "meetup": [
        {   #postings，文档ID-位置信息
            0 : [5, 23, 87],
            1 : [1],
            3 : [12, 43],
            5 : [7],
            8 : [9]
        },
        {   #skip_pointers,跳表指针
            0 : 3,
            3 : 8
        }
    ],
    "word":[
        {   #posting，文档ID-位置信息
            0: [5, 23, 87],
            1: [1],
            3: [12, 43],
            5: [7],
            8: [9]
        },
        {   #skip_pointer,跳表指针
            0 : 3,
            3 : 8
        }
    ]
    #...
}
'''倒排表最终结构，词典用trie树存储'''
inverted_index = [
    [
        {   #postings，文档ID-位置信息
            0 : [5, 23, 87],
            1 : [1],
            3 : [12, 43],
            5 : [7],
            8 : [9]
        },
        {   #skip_pointers,跳表指针
            0 : 3,
            3 : 8
        }
    ],
    [
        {   #posting，文档ID-位置信息
            0: [5, 23, 87],
            1: [1],
            3: [12, 43],
            5: [7],
            8: [9]
        },
        {   #skip_pointer,跳表指针
            0 : 3,
            3 : 8
        }
    ]
    #...
]

"""按块存储的结构"""
inverted_index_blocking = [
    (
        [3,6,133,269],
        0   #第0个word的索引
    ),
    (
        [2,4,7,9],
        16  #第4个word的索引
    ),
    #...
]

